src/InformationRegisters/ПоисковыйИндекс/ПоисковыйИндекс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПоисковыйИндекс</name>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПоисковыйИндекс/ManagerModule.bsl
////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьПредставление(Объект, Представление) Экспорт
	
	Запись 							 = РегистрыСведений.ПоисковыйИндекс.СоздатьМенеджерЗаписи();
	
	Запись.Объект 					 = Объект;
	Запись.Представление 			 = Представление;
	
	Запись.Записать();
	
КонецПроцедуры //УстановитьПредставление

#КонецОбласти
